{
  "servingAllStates": "Proudly Serving All 50 States",
  "contact": "Contact",
  "hours": "Hours",
  "monFri": "Mon - Fri: 8:00 am - 5:00 pm",
  "satSun": "Sat - Sun: Closed",
  "manuelFigueroa": "Manuel Figueroa",
  "attorney": "Attorney At Law",
  "empower": "empower clients to pursue new beginnings in the U.S.",
  "about": "Attorney Manuel Figueroa, JD, MA, is an immigration lawyer specializing in asylum law and deportation defense, providing expert legal representation to individuals seeking refuge in the United States. With a deep understanding of the complex and often emotional nature of asylum and deportation defense cases, Mr. Figueroa has successfully guided countless clients through these processes, defending their right to safety and protection. His office has represented high-profile asylum cases that have been featured in publications such as The New Yorker and Les Jours. His practice is available in all 50 states, having obtained asylum for clients in: Texas, New York, California, Chicago, New Jersey, Florida, Arizona, Massachusetts, Washington, Oklahoma, Maryland, and Georgia.\n\nMr. Figueroa assists individuals fleeing persecution due to factors such as race, religion, nationality, political opinion, or membership in a particular social group. His practice is distinguished by its attention to detail, personal approach, and legal innovation in immigration law.\n\nMr. Figueroa holds a bachelor's degree from Penn State University, a Juris Doctor from the University of Puerto Rico School of Law, and is an active member of the American Immigration Lawyers Association (AILA). With years of experience in the field, Mr. Figueroa is known for his ability to navigate complex asylum cases. In addition to asylum law and deportation defense, Mr. Figueroa also has experience in other areas of immigration law, such as family-based petitions, marriage, and naturalization.",
  "disclaimer": "Notice: The content on this website is intended solely for general informational purposes. Nothing presented here should be interpreted as legal advice for any particular case or situation. Viewing or using this information does not establish an attorney-client relationship.",
  "copyright": "© 2025 Figueroa Global Immigration LLC. All rights reserved."
} 