{
    "servingAllStates": "Servimos con Orgullo en los 50 Estados",
    "contact": "Contacto",
    "hours": "Horario",
    "monFri": "Lun - Vie: 8:00 am - 5:00 pm",
    "satSun": "Sáb - Dom: Cerrado",
    "manuelFigueroa": "Manuel Figueroa",
    "attorney": "Abogado",
    "empower": "empoderamos a nuestros clientes para perseguir nuevos comienzos en los EE.UU.",
    "about": "El Lic. Manuel Figueroa, JD, MA, es un abogado de inmigración especializado en la ley de asilo y defensa de deportación, brindando representación legal experta a personas que buscan refugio en los Estados Unidos. Con un profundo conocimiento de la naturaleza compleja y a menudo emocional de los casos de asilo y defensa de deportación, el Lic. Figueroa ha guiado exitosamente a innumerables clientes a través de estos procesos, defendiendo su derecho a la seguridad y protección. Su oficina ha representado casos de asilo mediáticos que se han destacado en publicaciones como The New Yorker y Les Jours. Su práctica está disponible en los 50 estados, habiendo obtenido asilo para sus clientes en: Texas, Nueva York, California, Chicago, Nueva Jersey, Florida, Arizona, Massachusetts, Washington, Oklahoma, Maryland y Georgia.\n\nEl Lic. Figueroa ayuda a personas que huyen de la persecución debido a factores como raza, religión, nacionalidad, opinión política o membresía en un grupo social particular. Su práctica se destaca por ser detallista, personal y a la vanguardia legal del derecho inmigratorio.\n\nEl Lic. Figueroa tiene una licenciatura de Penn State University, un Juris Doctor de la Escuela de Derecho de la Universidad de Puerto Rico, y es miembro activo de la Asociación Estadounidense de Abogados de Inmigración (AILA). Con años de experiencia en el campo, el Sr. Figueroa es conocido por su capacidad para navegar casos complejos de asilo. Además de la ley de asilo y defensa contra la deportación, el Lic. Figueroa también tiene experiencia en otras áreas de la ley de inmigración, tales como la inmigración basada en peticiones familiares, matrimonio y la naturalización.",
    "disclaimer": "Aviso: El contenido de este sitio web tiene únicamente fines informativos generales. Nada de lo presentado aquí debe interpretarse como asesoría legal para ningún caso o situación en particular. Ver o utilizar esta información no crea una relación abogado-cliente.",
    "copyright": "© 2025 Figueroa Global Immigration LLC. Todos los derechos reservados."
  }